000000* LOAN TRANSACTION FILE RECORD DEFINITION
000000 01  LOAN-RECORD.
000000     05  LOAN-NO               PIC 9(10).
000000     05  LOAN-USER-ID          PIC X(08).
000000     05  LOAN-BOOK-ID          PIC X(10).
000000     05  LOAN-DATE             PIC 9(08).
000000     05  LOAN-DUE-DATE         PIC 9(08).
000000     05  LOAN-RETURN-DATE      PIC 9(08).
000000     05  LOAN-STATUS           PIC X(01).
000000     05  FILLER                PIC X(50).
